nerd_food/on_the_ubuntubox.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 16:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nerd Food: On the UbuntuBox</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nerd Food: On the UbuntuBox</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
</tr>
</tbody>
</table>

<p>
Thursday, June 19, 2008
</p>

<div id="outline-container-orga247c56" class="outline-2">
<h2 id="orga247c56">The Regular User</h2>
<div class="outline-text-2" id="text-orga247c56">
<p>
As with many other geeks, I find myself in the unofficial position of
"computer guy" for family and friends (F&amp;F). This entails sorting out
broken computers, providing advice on new purchases for a variety of
devices and software packages, installing said devices and packages,
doing security updates and giving security advice, providing
mini-tutorials on applications, teaching basic programming - the list
goes on and on. The funny thing is, much like all other nerds, I may
moan about my duties but secretly I enjoy performing them. Sometimes I
get to setup people with cheap Ubuntu boxen, which they may complain
about a little in the beginning but eventually use in extremely
productive ways; and even on windows setups, I get to understand what
drives people to Microsoft and what its weak and strong points
are. Its a very instructive job.
</p>

<p>
Things got even more interesting since I bought my eee PC, a device
that is selling like fire in the polar winter. The eee PC helped me
understand a bit better how most people think. All along we, the Linux
community, have focused on providing a user experience that is very
similar to Windows: you may not have a Start Menu but you have the
Ubuntu logo; toolbars and menus are very similar and so on. Even the
newest eye-candy is similar to Mac and Vista's way of doing things
(although there's always the chicken-and-egg problem). The end result
is interesting: developers and regular Linux users are now convinced
that no one should have any difficulties at all moving from Windows to
KDE or Gnome; on the other hand, as soon as you sit a user down on a
Linux box, he or she immediately tells you that something is not
right. Objectively, the average user will probably not be able to
point out what's wrong, if anything at all, other than "this is not
Windows, can we not have Windows please".
</p>

<p>
The fantastic thing about the eee PC was that, of all people I showed
it to, not a single one said: bah, this is not Windows. Most of them
got on with the user interface immediately, and found it really
intuitive. In all my years of advocating Linux I never before seen a
reaction like this. I did absolutely no advocating whatsoever, no
mention about freedom or the superiority of free software. Just
letting them play with it was enough. As an example, my girlfriend has
been using Linux for over 5 years, and I get the periodic complains of
"why can't we just use windows" whenever I have some difficulties
installing a device, or I break the world on a dist-upgrade. But
within minutes of playing with the eee, her reaction was: "I want one
of these!!".
</p>

<p>
The reactions I've seen towards the eee PC are almost the opposite of
the few Vista users I've spoken to. Sure, Vista looks nice, but have
you tried installing a one-click wireless router? That's when F&amp;F call
me out, when it all goes wrong with the "one-click" cheap product they
bought. But thing is, I can't say much in Ubuntu's defense either. For
example, I spent several days installing a Huawei e220 modem to
provide 3G Internet access to my nephews, and let me just tell you,
trivial would not have been a word one could apply to any part of the
process. Vodaphone's new clever GUI may be good for Vodaphone users
but I never got the damn thing to cooperate. True, the whole exercise
wasn't taxing for a nerd - hey, its fun to look at AT commands now and
then - but there is no way, just noooo waaaay a regular user would
have gone through the pain, even with the brilliant Ubuntu forums to
hand.
</p>

<p>
Now, before we go any further, I can already hear the complaints: "so
you've chatted to what, twenty people, and now you think you
understand the market?". Well, that much is true, I cannot claim any
statistical accuracy to my diagnostics. These are my opinions; the
entire article is based on empiricism and small samples. However, if
my line argumentation is done correctly and rightly interprets the
success of the eee, then there must be some truth to my views because
I've tried to align them with the eee. The market has given a verdict
on this gadget, loudly and unequivocally.
</p>

<p>
The eee PC is also a brilliant illustration of the huge divide between
regular users and the developers who are tasked with providing
software for them. At a moment in time where the Gnome community is
yet again rethinking the future of Gnome, not a single regular user
would find this debate interesting. This should send all the alarm
bells ringing, but unfortunately that doesn't seem to be the case. The
truth is, regular users don't want flashy 3D desktops, although they
can eventually cope with them; they don't need spinning cubes although
they may start using them once they understand it. What they really
want is simplicity. They have a simple set of tasks to perform, and
they want to do so cheaply and reliably, and they truly do not
understand why everything has to be so complicated and why do
computers have to change so much so often.
</p>

<p>
So what made the eee popular? In my opinion, there are two key points:
</p>

<ul class="org-ul">
<li>Its cheap. No one would even have a look at it if it was 400 GBP</li>
<li>Its easy.</li>
</ul>

<p>
These are the key selling points to a regular user. To illustrate the
second point, when I said to my girlfriend I was thinking about
installing Ubuntu Hardy on the eee, she replied in dismay: "Why would
you do that??".
</p>
</div>
</div>
