nerd_food/on_the_ubuntubox.org
* The Regular User Use Cases

The key thing to notice about the eee is that most users don't even
know its not running Windows. Its just an appliance, a bit like a
PlayStation, and thus there is no need to enquire about it's operative
system. Like an appliance, it is also expected to be switched on and
just work - the fast boot reinforces this idea. The interface provided
is also designed for the tasks common to the vast majority of regular
computer users, and allows them to find things fast. But, looking at
the wider problem, what do our regular users do with their computers?
I compiled a list of all use cases I found in my user base:

- Internet: email, browsing, playing on-line games and youtube;
- Listen to music, sync with their music player;
- Watch local video content;
- Talk with their friends: IM, VOIP
- Play (basic) games: on all cases, real gaming is done on the
  PlayStation;
- Work: word-processor by far, some spreadsheet use but "it's quite
  hard";
- Burning and ripping;
- Downloading: torrents, etc. Not very popular because "its
  complicated";
- Digital photo management: storage, some very basic manipulation
  (make it smaller for emailing);
- Printing: mainly for school/University; pictures in very few cases.
- In addition to these, some additional requirements crop up:
- Windows users all have proprietary firewalls and virus scanners;
- All machines are multi-user, and data must be kept private -
  especially with the youngsters;
- Machines must withstand battering: switched off at any point, banged
  about, dropped, etc;
- Internet connectivity is vital, ADSL, cable and 3G are
  used. Computers are useless without the Internet;
- Wireless around the house is vital. External wireless is nice, but
  not frequently used because "it's too complicated";
- Costs must be kept exceedingly low as IT budget is normally very
  low;
- That's it. You'd be amazed with the percentage of the market one
  covers with only these use cases; not just doing them, but doing
  them well, like a PlayStation plays games.

And what are the biggest complaints about computers?

- They're really hard. Installing hardware and software is a
  nightmare, and they'd be stuffed without the local nerd;
- They break easily. One of my Vista users is still in disbelief that
  installing wireless drivers could cause the DVD drive to stop
  working;
- They're expensive. Sure you can get a cheap'ish box but then
  everything else is expensive (software, peripherals, etc);
- They change far too frequently. Most users just about got around XPs
  user interface just to see it all change again;
- They're insecure. They don't know how or why but that's what they've
  heard. That and the constant popups that look like viruses.
- On one hand, the regular user is quite advanced, making multi-user
  and networking a central part of its computer experience. On the
  other hand, he/she is very naive: the vast majority of computing
  power goes under-utilised - the OS gobbling most of the resources
  for no good reason - and the majority of software expenses easily
  avoidable by using freely available applications. Regular users
  haven't got nowhere near using Media Centres, "clever" media
  management software, or even connecting their PCs to the TVs. All
  these things they consider "advanced" and yet nerds and more savvy
  users have been doing it for years. One cannot help but feel that
  there is a massive market out there for the taking - a market that
  Vista cannot aim to grab because it's diametrically opposed to its
  needs - and yet, no one else seems to find the path to its door.

