nerd_food/on_the_ubuntubox.html

<div id="outline-container-org24f7144" class="outline-2">
<h2 id="org24f7144">UbuntuBox: The Hardware Platform</h2>
<div class="outline-text-2" id="text-org24f7144">
<p>
The rest of this article is an Ubuntero Gedankenexperiment: if I was a
manufacturer, what sort of box would I like my F&amp;F to have? What would
make my life and their life easier? The short answer to that question
is a PlayStation 2 like box but with PC-like functionality. The long
answer is, well, long.
</p>

<p>
I'm not going to bother with engineering reality here - I'm sure some
requirements will be so conflicting they cannot possibly be
implemented. However, I've got zero experience in hardware
manufacturing, weights, cooling, large scale deployment and so on - so
much so that I'm not even going to bother pretending; any assumptions
I'd make would be wrong anyway. So, to make matters easy, I'll just
ask for it all - impossible or not - and wait for the reality check to
come in.
</p>

<p>
The first, very different thing about our box is that it's not a
computer. Well, inside it is a regular PC of course, but it doesn't
look like one. It is designed to look exactly like a DVD player, and
to fit your living room. A bog-standard black-box with a basic LED
display would do. Inside, it has:
</p>

<ul class="org-ul">
<li>Multiple cores: four would be ideal, but at least two. They don't
have to be particularly fast (1.x Ghz would do, but I guess 2 Ghz
would be easier to find);</li>
<li>4 GB of RAM: can be the slowest around, but we need at least 4; the
more the merrier, of course;</li>
<li>250 to 500 GB hard drive: the more the merrier. Doesn't have to be
fast, we just need the space;</li>
<li>Average video card: key things are RGB/HDMI and TV out; resolution
decent enough to play most games (not the latest);</li>
<li>Loads of USB ports;</li>
<li>RW DVD drive;</li>
<li>Analog TV + DVB card (for FreeView in England);</li>
<li>Wired and Wireless Ethernet;</li>
<li>Sound card with 5.1 surround sound: doesn't have to be a super card,
just an entry level one would do;</li>
<li>SD card, compact flash readers;</li>
<li>Ability to control the box with a remote control;</li>
</ul>

<p>
And now the key limiting factor:
</p>

<ul class="org-ul">
<li>The overall cost of the box must not exceed 200 GBP. This may
require some tweaking, e.g. if raising it to 299 means we can put
all features in, it may be worthwhile.</li>
<li>Notice that all the hardware will be standard on all boxes of the
same generation. This is all commodity hardware - certainly nothing
proprietary - but without the heterogeneity that is associated with
it. Note that control is a key feature - the limiting of user and
vendor freedom to swap things at will. We'll return to the topic
later on, as I'm sure it will prove controversial.</li>
</ul>

<p>
Now, how does the box behave for the regular use case? Well, you buy
it, plug it in, set all the cables up and start it up. You will see
only two things on boot: the logo (say the Ubuntu logo) fading in and
out, and the console password. That's it. No BIOS, no flashing
X-Server, nothing else. Within a few seconds you'll be prompted for
the console password and given an option of not needing a password in
the future (Note: console is <span class="underline">not</span> root). Lets leave the desktop at
that for the moment as we'll cover it properly in the next section.
</p>

<p>
What about Internet access, you ask? Well, you will need to buy one of
the available modems:
</p>

<ul class="org-ul">
<li>3G;</li>
<li>ADSL;</li>
<li>Cable.</li>
</ul>

<p>
Each of these modems are made available at market prices (i.e. as
cheap as possible); however, they will have been officially and
exhaustively tested and stamped with a "UbuntuBox compliant vX" or
some such, where vX is the box's generation. To be compliant means
that your hardware has been throughly tested and is known to work with
the hardware and software in a given generation. When you plug any of
these devices after console login, a simple wizard will appear asking
you to choose a provider. Each provider will have been also part of a
certification program before inclusion.
</p>

<p>
The other networking device is an Ethernet Switch. This is only
required if your modem does not come with switching abilities (maybe
in the 3G case). Network Manager already does a pretty good job of
this, so all you'll need to do is setup the network on your console
session (SSID, etc). You can use a USB keyboard for this or just
endure typing from the remote control.
</p>

<p>
Note that the certification requirement is extended to all hardware
used with the box. In other words, there is a pretty draconian control
on the hardware platform. Users are, of course, free to do as they
wish with the device they bought, but if they go down the uncertified
route, all support contracts are rendered void (more on this
later). The truth is, its impossible to provide cost-effective support
to all possible permutations of off-the-shelf hardware - a fact all
Linux and Windows nerds are all too aware, as are Mac engineers. There
will always be some weird combination that makes things break, and it
can take many, many man-days to fix it; when you have 1M boxen out
there, this cost would be prohibitive. The only way is to control the
standard platform.
</p>

<p>
For all of its closeness, the certification process is actually open
when compared with other companies. All the criteria involved is made
available in public websites, APIs with all the hooks required to
extend wizards are public (with examples), companies are free to do
public dry runs and any company can request a slot for
validation. Perhaps some cost needs to be associated with the process
(time is money after all, and we must discourage the less serious
companies), but in general, the process is fair and public. The tests,
however, are stringent; hardware that passes <span class="underline">cannot</span> fail when
deployed in the wild.
</p>

<p>
One final note with regards to entry level hardware. Some people may
not be aware, but the computing power available as standard today is
incredibly high. For example, one of the PCs I maintain has a 1Ghz
CPU, 512 MB of ram, 10 GB hard drive and an average ATI card; I bought
it for 60 GBP. This machine runs Ubuntu Hardy and sometimes has to
cope with as many as 3 users logged on. It doesn't do any of the 3D
Compiz special effects due to the dodgy ATI card, but it does pretty
much everything else. You'd be surprised on what you can do with the
slowest RAM, cheapest sound-card and so on.
</p>
</div>
</div>
