nerd_food/on_the_ubuntubox.html

<div id="outline-container-org6f58d0b" class="outline-2">
<h2 id="org6f58d0b">UbuntuBox: The Software Platform</h2>
<div class="outline-text-2" id="text-org6f58d0b">
<p>
By now you must have guessed that the box would be running Ubuntu; but
this is not your average Ubuntu. Using an interface along the lines of
Remix, we would make a clear statement that this is an appliance - not
a PC. As the eee has demonstrated, perceptions matter the
most. Remix's interface will remind no one of Windows, whilst at the
same time making the most common tasks really easy to locate.
</p>

<p>
In addition to regular Ubuntu, the software platform would provide,
out-of-the box, complete media support. This entails having GStreamer
will all the proprietary plugins, Adobe's flash and any other plug-ins
that may be required for it to play all the media one can throw at it.
</p>

<p>
The UbuntuBox is mainly a clever Media Centre, and, as such,
applications such as Elisa, Rhythmbox/Banshee, F-Spot, etc are at the
core of the user experience. These applications would need to be
modified slightly to allow for a better multi-user experience
(e.g. shared photo/music collections, good PVR and DVB support, etc),
but on the whole the functionality they already provide is more than
sufficient for most users.
</p>

<p>
As with the hardware side, the software platform is tightly
controlled. Only official Ubuntu repositories are allowed, and all
software is tested and known to work with the current generation of
boxen. And, as with hardware, the software platform is made available
for third-party who want to deploy their wares. An apt interface
similar to click 'n run is made available so that commercial companies
can sell their wares on the platform and charge for it. They would
have to go through compliance first, of course, but if the number of
boxes out there is large enough, there will be companies interested in
doing so. This would mean, for example, that a games market could
begin to emerge based on Wine; instead of having each user test each
Windows application for their particular setup, with many users having
mixed results, this would put the onus of the testing on the company
owning the platform and on the software vendor. Games would have to be
repackaged as debs and be made installable just like any other Debian
package. Of course, the same logic could be applied to any windows
Application.
</p>

<p>
As I mentioned previously, boxen come with support contracts. A
standard support contract should provide:
</p>

<ul class="org-ul">
<li>Access to all security fixes;</li>
<li>Troubleshooting of problems, including someone remotely accessing your machine to help you sort it out.</li>
<li>Due its homogeneity, UbuntuBox is very vulnerable to attacks. If an exploit is out in the wild, large number of boxen can be compromised very quickly. To make things a bit safer, the platform has the following features:</li>
<li>SELinux is used throughout;</li>
<li>All remote access is done via SSH and is only enabled on demand (e.g. when tech support needs access);</li>
<li>All users have passwords and must change them regularly;</li>
<li>There is an encrypted folder (or vault) for important documents, available from each user's desktop.</li>
</ul>

<p>
Finally, notice that binary drivers and proprietary applications are
avoided when possible - e.g. Intel drivers would be preferable to
nVidia, provided they have the same feature-set. However, where the
proprietary solutions are technically superior, they should be
used. Skype springs to mind.
</p>
</div>
</div>

<div id="outline-container-org18c61b9" class="outline-2">
<h2 id="org18c61b9">UbuntuTerm</h2>
<div class="outline-text-2" id="text-org18c61b9">
<p>
Readers may be left wondering, "this is all very nice and dandy, but
am I supposed to do my word processing using a TV?". Well, not
quite. Whilst the TV is central, its use is focused on the gaming and
Media Centre aspects of the box. If you want to use UbuntuBox as a
regular PC, you will need to buy a UbuntuTerm. Just what is a
UbuntuTerm? It is a dumb terminal of "old" in disguise (e.g. LTSP). It
is nothing but a LCD display of a moderately decent size (19" say),
with an attached PC - the back of the monitor or the base would do, as
the hardware is minimal. The PC has a basic single core chip with low
power consumption to avoid fans and on-board video, sound and wireless
Ethernet. It is designed to boot off the network if BOOTP can be used
over wireless; if not, from flash. Whichever way it boots, its
configured to find the mothership and start an XDMCP session on
it. Its price should hover around the 100 GBP mark.
</p>

<p>
As with any decent terminal these days, UbuntuTerm is designed to fool
you in believing you are sitting on the server. X already does most of
the magic required, but we need to take it one level further: if you
start playing music, the audio will come out of your local speakers
via pulseaudio; if you plug your iPod via its USB port, the device
will show up on your desktop; if you start playing a game, the FPSs
you get remotely will comparable to playing it on the server. As with
everything else mentioned in this article, all of these technologies
are readily available on the wider community; its a matter of
packaging them in a format that regular users can digest (see Dave's
blog for example).
</p>

<p>
The standard hardware on a UbuntuTerm is as follows:
</p>

<ul class="org-ul">
<li>Low RAM, basic video card;</li>
<li>Speakers attached to monitor;</li>
<li>SD Card, compact flash readers;</li>
<li>WebCam, headset;</li>
<li>Lots of USB ports</li>
</ul>

<p>
A house can have as many UbuntuTerms as required, and the server
should easily cope with at least 6 of them without too much trouble,
depending on what sort of activities the users get up to.
</p>

<p>
Finally, in addition to the UbuntuTerm in hardware, there is also a
UbuntuSoftTerm. This is nothing but a basic Cygwin install with X.org,
allowing owners of PCs to connect to their UbuntuBox without having to
buy an entire UbuntuTerm.
</p>
</div>
</div>
