nerd_food/on_the_ubuntubox.html

<div id="outline-container-orgbccd174" class="outline-2">
<h2 id="orgbccd174">Conclusions</h2>
<div class="outline-text-2" id="text-orgbccd174">
<p>
UbuntuBox is an attempt to ride the wave of netbooks; it also tries to
make strengths out of Linux's weaknesses. The box is not may not live
up to everyone's ideals of Free Software, but its main objective is to
increase Ubuntu's installed base, allowing us to start applying
leverage against the hardware and software manufacturers. The design
of the box takes into account the needs of a very large segment of the
market which have basic computing needs, but don't want to became
experts - just like a PlayStation owner does not want to know the
ins-and-outs of the PowerPC chips.
</p>

<p>
The UbuntuBox is an appliance, and as such is designed to be used in a
fairly rigid number of ways, but that cannot be avoided if one wants
to stay true to its nature. The more freedom one gives to users, the
worse the end product will be for the Regular User, which cares not
for intricate technical detail.
</p>

<p>
Note also I haven't spent much time talking about business models for
the company providing UbuntuBoxen. The opportunities should be there
to create a sustainable business, based on revenue streams such as
monthly payments for support, fees from OEMs, payments to access the
platform (content providers). However, I don't know too much about
making money so I leave that as an exercise to the reader. The other
interesting aspect is comunity leverage. If managed properly, a
project of this nature could enjoy large amounts of comunity
participation: in testing, packaging, marketing, support - in fact,
pretty much all areas can be shared with the comunity, reducing costs
greatly.
</p>

<p>
All and all, if there was an UbuntuBox out there for sale, I'd buy
it. I think such a device would have a good chance of capturing this
illusive segment of the market, giving Linux a foothold, however
small, on the desktop.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-28 Sun 16:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
